In [8]:
! pip install sqlalchemy
! pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\users\micel\appdata\roaming\python\python312\site-packages (2.0.28)
Requirement already satisfied: typing-extensions>=4.6.0 in d:\programmes\miniconda\lib\site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in d:\programmes\miniconda\lib\site-packages (from sqlalchemy) (3.0.1)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in d:\programmes\miniconda\lib\site-packages (1.0.2)

In [20]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
import urllib.parse
password = getpass.getpass()

In [2]:
import sqlalchemy

In [3]:
import mysql.connector

In [22]:
# Establishing a connection to the Sakila database
connection = mysql.connector.connect(
    host="127.0.0.1",
    port = "3306",
    user="root",
    password ="Silver57",
    database ="sakila"
)

In [23]:
# Check if the connection is successful
if connection.is_connected():
    print("Connected to MySQL database")
else:
    print("Failed to connect to MySQL database")

Connected to MySQL database

In [24]:
# Creating a cursor object
cursor = connection.cursor()

# Executing a sample query
cursor.execute("SELECT * FROM actor LIMIT 5")

# Fetching the results
results = cursor.fetchall()

# Displaying the results
for row in results:
    print(row)

# Closing cursor and connection
cursor.close()
connection.close()

(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))
(2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33))
(3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33))
(4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33))
(5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33))

# DO NOT RUN --> USELESS 
#  connecting the database

# from sqlalchemy as db
# engine = db.create_engine("sqlite:///european_database.sqlite")

# conn = engine.connect()

In [14]:
#other way to connect to MySQL db
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [25]:
# new_df = pd.read_sql_query(query to define HERE, engine)

NameError: name 'sql' is not defined

In [26]:
def rentals_month(engine, month, year):
    # Define the SQL query to retrieve rental data for the specified month and year
    sql_query = f"""
        SELECT
            r.rental_id,
            c.customer_id,
            c.first_name,
            c.last_name,
            r.rental_date,
            r.return_date
        FROM
            rental r
        INNER JOIN
            customer c ON r.customer_id = c.customer_id
        WHERE
            MONTH(r.rental_date) = {month} AND
            YEAR(r.rental_date) = {year}
        """

    # Execute the SQL query and load the results into a DataFrame
    rental_df = pd.read_sql_query(sql_query, engine)

    return rental_df

In [28]:
rentals_month(engine, 7, 2005)

,rental_id,customer_id,first_name,last_name,rental_date,return_date
0,4526,1,MARY,SMITH,2005-07-08 03:17:05,2005-07-14 01:19:05
1,4611,1,MARY,SMITH,2005-07-08 07:33:56,2005-07-12 13:25:56
2,5244,1,MARY,SMITH,2005-07-09 13:24:07,2005-07-14 14:01:07
3,5326,1,MARY,SMITH,2005-07-09 16:38:01,2005-07-13 18:02:01
4,6163,1,MARY,SMITH,2005-07-11 10:13:46,2005-07-19 13:15:46
...,...,...,...,...,...,...
6704,6800,599,AUSTIN,CINTRON,2005-07-12 17:03:56,2005-07-21 20:32:56
6705,6895,599,AUSTIN,CINTRON,2005-07-12 21:23:59,2005-07-19 20:47:59
6706,8965,599,AUSTIN,CINTRON,2005-07-30 03:52:37,2005-08-05 01:28:37
6707,9630,599,AUSTIN,CINTRON,2005-07-31 04:57:07,2005-08-07 10:55:07
6708,9679,599,AUSTIN,CINTRON,2005-07-31 06:41:19,2005-08-02 07:23:19

'''
CHAT GPT INFO 

mport pandas as pd
from sqlalchemy import create_engine

# Define your SQL query
sql_query = "SELECT * FROM your_table_name;"

# Define your SQLAlchemy engine
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

# Execute the SQL query and load the results into a DataFrame
new_df = pd.read_sql_query(sql_query, engine)

# Now, new_df contains the results of your SQL query as a DataFrame

'''